app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address", "description", "title", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]